In [1]:
import sqlite3
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
connection = sqlite3.connect('my_database2.db')
%load_ext sql
%sql sqlite:///my_database2.db

In [ ]:
# 1. Провести оценку количества товара на складе по наименованиям: менее 10 – мало,
# от 10 до 100 – достаточно, более 100 – избыточно.

In [15]:
%%sql
SELECT
    Product.name,
    quantity,
    CASE
        WHEN quantity < 10 THEN "мало"
        WHEN quantity BETWEEN 10 AND 100 THEN "достаточно"
        ELSE "избыточно"
    END as state
FROM Store
INNER JOIN Product ON ID_Product = Product.id
GROUP BY ID_Product

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', 100, 'достаточно'),
 ('Ноутбук', 50, 'достаточно'),
 ('Зонтик', 200, 'избыточно'),
 ('Фотоаппарат', 30, 'достаточно'),
 ('Сумка', 0, 'мало'),
 ('Наушники', 100, 'достаточно'),
 ('Книга', 150, 'избыточно')]

In [ ]:
# 2. Вывести наименования товаров, количество которых на складе от 1 до 10.

In [47]:
%%sql
SELECT name, quantity FROM Store
INNER JOIN Product ON ID_Product = Product.id
GROUP BY ID_Product
HAVING quantity BETWEEN 1 AND 100

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', 100),
 ('Ноутбук', 50),
 ('Фотоаппарат', 30),
 ('Наушники', 100)]

In [ ]:
# 3. Определить тройку товаров, выручка за которые самая большая.

In [44]:
%%sql
SELECT Product.name, (Store.price * Deal.quantity) as revenue FROM Deal
INNER JOIN Store ON ID_Store = Store.id
INNER JOIN Product ON ID_Product = Product.id
GROUP BY ID_Product
ORDER BY revenue DESC
LIMIT 3

 * sqlite:///my_database2.db
Done.

[('Ноутбук', 6400), ('Футбольный мяч', 250)]

In [32]:
# Определить суммарную стоимость продаж каждого товара по месяцам.

 * sqlite:///my_database2.db
Done.

[(1, 1, 1, 100, 50, '2025-01-10'),
 (2, 2, 1, 150, 55, '2025-02-15'),
 (3, 1, 2, 50, 800, '2025-01-05'),
 (4, 3, 2, 70, 750, '2025-03-20'),
 (5, 2, 3, 200, 15, '2025-01-20'),
 (6, 3, 4, 30, 1200, '2025-01-30'),
 (7, 1, 4, 40, 1250, '2025-02-10'),
 (8, 1, 4, 200, 1350, '2025-02-10'),
 (9, 1, 5, 0, 50, '2025-03-05'),
 (10, 2, 6, 100, 100, '2025-02-28'),
 (11, 2, 7, 150, 10, '2025-01-15')]